//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Низове и операции с тях
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// създава променливата firstName
let firstName;

// записва низът "Ada" в firstName
firstName = "Ada";

// създава променливата lastName и записва низът "Byron" в нея
let lastName = "Byron";

// създава променливата fullName и записва в нея "Ada Byron", като конкатенираме двата низа със спейс между тях:
let fullName = firstName + " " + lastName;

// показва в конзолата на браузъра стойността на променливата fullName:
console.log("fullName: ", fullName);

// принтираме  празен ред в конзолата
console.log("\n");

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Числови данни
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// цяло, положително число
let answer = 42;
console.log("answer: ", answer);

// цяло, отрицателно число
let balance = -10000;
console.log("balance: ", balance);

// реално, с плаваща запетая (floating-poin number)
const PI = 3.14159;
console.log("pi: ", PI);

// записваме празен ред в конзолата
console.log("\n");

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Аритметични операции
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Задача 1:
// Напишете 2 примера за операцията "Делене по модул".

// Пример : Изчисляване на ДДС:
// разгледайте и осмислете как работи кода даден по-долу:
// цена с включено ДДС
let vatIncludedPrice = 3845.76;
console.log("цена с включено ДДС: " + vatIncludedPrice);

// изчисляване на основната цената (без ДДС):
let basePrice = vatIncludedPrice / 1.2;
console.log("основна цена (без ДДС): " + basePrice);

// изчисляване на ДДС
let vat = (20 / 100) * basePrice;
console.log("ДДС (вариант 1): " + vat);

// изчисляване на ДДС - кратък начин
vat = vatIncludedPrice / 6;
console.log("ДДС (вариант 2): " + vat);
